Repository: geocarlos/throughlettersandcode-ui
Catalog: src/locale/messages.*.xlf
Languages: pt

# navbarHome
source: Home
pt: Início

# navbarAbout
source: About
pt: Sobre

# navbarArticles
source: Articles
pt: Artigos

# navbarVideos
source: Videos
pt: Vídeos

# navbarApps
source: Apps
pt: Aplicativos

# navbarLogout
source: Logout
pt: Sair

# homeHeader1st
source: Human languages,
pt: Linguagem humana,

# homeHeader2nd
source: computer languages...
pt: linguagens de computador...

# homeHeader3rd
source: It is all about code!
pt: É tudo código!

# homeParagraph1
source: Language, literature, programming languages, software development... Have you ever thought about seeing such things together? Well, I have dealt with both for a while.
pt: Língua, literatura, linguagens de programação, desenvolvimento de software... Você já imaginou ver essas coisas juntas? Bem, faz um tempo que eu lido com ambas as coisas.

# homeParagraph2
source: I have developed this site to share my thoughts and experience on translation from English to Portuguese, and to some extent, translation in general for software localization.
pt: Desenvolvi este site para compartilhar minhas ideias e experiência sobre tradução de inglês para português e, até certo ponto, tradução em geral para localização de software.

# homeParagraph3
source: I also share some hopefully relevant knowledge and insight in the Portuguese language, especially the variation spoken in Brazil.
pt: Também compartilho alguns conhecimentos que espero serem relevantes sobre a língua portuguesa, principalmente a variante falada no Brasil.

# articlesHeader
source: Articles
pt: Artigos

# articlesReadMore
source: Read more
pt: Ler mais

# headerApps
source: Apps
pt: Aplicativos

# videosHeader
source: Videos
pt: Vídeos

# aboutHeader
source: About myself
pt: Quem sou

# aboutParagraph1
source: My name is Geocarlos. I have worked as an English-Portuguese translator since 2007. In 2009, with ICanLocalize, an online translation/localization service provided by OnTheGo Systems, which is a company based in Las Vegas, I started working in projects for the localization of mobile applications, especially iOS and Android apps, and websites. I have a degree in English and Portuguese language and literature, and a graduate certificate in English-Portuguese translation.
pt: Meu nome é Geocarlos. Trabalho como tradutor de inglês para português desde 2007. Em 2009, com o ICanLocalize, um serviço de tradução/localização online fornecido por OnTheGo Systems, que é uma empresa com base em Las Vegas, comecei a trabalhar em projetos para localização de de aplicativos móveis, principalmente aplicativos para iOS e Android, e sites. Tenho graduação em letras com habilitação em português e inglês e especialização (pós-graduação lato-sensu) em tradução de inglês para português.

# aboutParagraph2
source: In August 2017, I completed a undergraduate program in system development. I have developed some skills in Java, JavaScript (DOM and Node, with Express) and TypeScript (with Angular and Ionic). I have learned and praticed Ionic and Cordova on my own, developing hybrid mobile apps.
pt: Em agosto de 2017, concluí o curso superior de tecnologia em análise e desenvolvimento de sistemas. Tenho desenvolvido algumas habilidades em Java, JavaScript (DOM e Node, com Express) e TypeScript (com Angular e Ionic). Aprendi e pratiquei Ionic e Cordova sozinho, desenvolvimento aplicativos híbridos.

# aboutParagraph3
source: Besides translation projects, I am also interested in entry level jobs as a software developer. As an English-Portuguese translator, I have a vast experience, including projects with over 100,000 words. Some of the companies I have worked with through ICanLocalize are HunterLab (website, PDF brochures), SkyFold (website), Kakao (iOS and Android app), Entec Polymers (website), Grand Hotel et de Milan, to mention just a few. I am willing to take tests before getting hired for any project.
pt: Além de projetos de tradução, também tenho interesse em trabalhos em nível iniciante como desenvolvedor de software. Como tradutor de inglês para português, tenho uma vasta experiência, incluindo projetos com mais de 100 mil palavras. Algumas das empresas com as quais tenho trabalhado através do ICanLocalize são HunterLab (site e material de divulgação em PDF), SkyFold (site), Kakao (aplicativo para iOS e Android), Entec Polymers (site), Grand Hotel et de Milan, para citar só alguns. Estou disposto a fazer testes antes de ser contratado para qualquer projeto.

# footerTop
source: Top
pt: Topo
